---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.ConceptualConstructionShadeType.InvalidShadeTypeConstruction
enum: Autodesk.Revit.DB.Analysis.ConceptualConstructionShadeType
source: html/83f85da2-200e-1a3f-f879-9778de9ff548.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualConstructionShadeType.InvalidShadeTypeConstruction

Invalid value/not set Shade Type Construction